// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//

// let friends = ['Ivan','Slavik','Grisha','Lera', 'Ira']
//
// if(friends.length >=3){
//     alert('Цей масив є великим в якому 3 або більше алементів!')
// }else {
//     alert('Цей масив є маленьким, у ньому менше 3 елементів')
// }


//
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

const arr=[120,220,30];
middle_element=Math.floor(arr.length/2)
console.log(arr[middle_element])

let max=Math.max(120,220,30);
let min =Math.min(120,220,30);

let mdl_elemnt=0;
arr.forEach((item=>{
    if(item !== max && item !==min){
        mdl_elemnt=item
    }
}))
console.log(mdl_elemnt)

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let a = 1;
// let b = 10;
//
//
// const result = a+b>4 ? 'Мало' : 'Багато'
//
// console.log(result)


//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// const number = +prompt('Введіть число')
//
//
// const result = number>0 ? 'Позитивне' : number < 0 ? 'Негативне' : 'дорівнює нулю'
// console.log(result)