// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
//  const firstNum = +prompt('Введіть перше число: ')
// const secondNum = +prompt('Введіть друге число: ')
//
// if(firstNum>secondNum){
//     console.log(`Перше число ${firstNum} є більше ніж друге ${secondNum}`)
// }else if(firstNum == secondNum) {
//     console.log(`Ви ввели два числа які є рівні між собою!!!`)
// }else {
//     console.log(`Друге число ${secondNum} є більше ніж перше ${firstNum}`)
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// const number_of_apartament = +prompt('Введіть номер квартири: ')
//
// if(number_of_apartament <=20){
//     console.log('Дана квартира знаходиться у першому підїзді!')
// }else if(number_of_apartament <=48){
//     console.log('Дана квартира знаходиться у другому підїзді!')
// }else if(number_of_apartament <= 90){
//     console.log('Дана квартира знаходиться у третьому підїзді!')
// }else {
//     console.log('Неможемо знайти даної квартири.......')
// }



// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// const num = +prompt('Введіть число: ')
//
// if(num==10){
//     console.log('Вірно')
// }else {
//     console.log('Невірно')
// }


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//

// const x={
//     name:'Edward'
// }

// if(typeof(x)=='number'){
//     console.log('1')
// }else if(typeof(x)=='string'){
//     console.log('2')
// }else if(typeof(x)=='boolean'){
//     console.log('3')
// }else if(typeof(x)=='object'){
//     console.log('4')
// }else{
//     console.log('Невідомий тип......')
// }


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// const temp = 23;
//
// if(temp >= 10 && temp <= 22){
//     console.log('Йдемо вчитися')
// }else {
//     console.log('Сидимо вдома і вчимося онлайн')
// }


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// const answer = +prompt('Введіть числодля отримання призу: ')
//
// switch (answer){
//     case 1:
//         console.log('Ваш приз авто!')
//         break
//     case 2:
//         console.log('Ваш приз мото!')
//         break
//     case 3:
//         console.log('Ваш приз телефон!')
//         break
//     case 4:
//         console.log('Ваш приз телевізор!')
//         break
//     case 5:
//         console.log('Ваш приз квартира!')
//         break
//     default :
//         console.log('Введене число невірне!!!!!')
//         break
// }